#pragma once
#include "FVertexPosColor.h"
#include "TArray.h"

inline TArray<FVertexPosColorUV> cube_vertices = {
    // 앞면 (Front face) - Z = +0.5 - Red 계열 (LH CW)
    { -0.5f,  0.5f,  0.5f, 1.0f, 0.0f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌상
    { -0.5f, -0.5f,  0.5f, 0.8f, 0.0f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌하
    {  0.5f,  0.5f,  0.5f, 1.0f, 0.2f, 0.2f, 1.0f, 0.0f, 0.0f}, // 우상
    {  0.5f,  0.5f,  0.5f, 1.0f, 0.2f, 0.2f, 1.0f, 0.0f, 0.0f}, // 우상
    { -0.5f, -0.5f,  0.5f, 0.8f, 0.0f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌하
    {  0.5f, -0.5f,  0.5f, 0.9f, 0.1f, 0.1f, 1.0f, 0.0f, 0.0f}, // 우하

    // 뒷면 (Back face) - Z = -0.5 - Blue 계열 (LH CW)
    {  0.5f,  0.5f, -0.5f, 0.0f, 0.0f, 1.0f, 1.0f,0.0f, 0.0f}, // 좌상 (뒤에서 볼 때)
    {  0.5f, -0.5f, -0.5f, 0.0f, 0.0f, 0.8f, 1.0f,0.0f, 0.0f}, // 좌하 (뒤에서 볼 때)
    { -0.5f,  0.5f, -0.5f, 0.2f, 0.2f, 1.0f, 1.0f,0.0f, 0.0f}, // 우상 (뒤에서 볼 때)
    { -0.5f,  0.5f, -0.5f, 0.2f, 0.2f, 1.0f, 1.0f,0.0f, 0.0f}, // 우상 (뒤에서 볼 때)
    {  0.5f, -0.5f, -0.5f, 0.0f, 0.0f, 0.8f, 1.0f,0.0f, 0.0f}, // 좌하 (뒤에서 볼 때)
    { -0.5f, -0.5f, -0.5f, 0.1f, 0.1f, 0.9f, 1.0f,0.0f, 0.0f}, // 우하 (뒤에서 볼 때)

    // 우측면 (Right face) - X = +0.5 - Green 계열 (LH CW)
    {  0.5f,  0.5f,  0.5f, 0.0f, 1.0f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌상 (우측에서 볼 때)
    {  0.5f, -0.5f,  0.5f, 0.0f, 0.8f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌하 (우측에서 볼 때)
    {  0.5f,  0.5f, -0.5f, 0.2f, 1.0f, 0.2f, 1.0f, 0.0f, 0.0f}, // 우상 (우측에서 볼 때)
    {  0.5f,  0.5f, -0.5f, 0.2f, 1.0f, 0.2f, 1.0f, 0.0f, 0.0f}, // 우상 (우측에서 볼 때)
    {  0.5f, -0.5f,  0.5f, 0.0f, 0.8f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌하 (우측에서 볼 때)
    {  0.5f, -0.5f, -0.5f, 0.1f, 0.9f, 0.1f, 1.0f, 0.0f, 0.0f}, // 우하 (우측에서 볼 때)

    // 좌측면 (Left face) - X = -0.5 - Yellow 계열, (LH CW)
    { -0.5f,  0.5f, -0.5f, 1.0f, 1.0f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌상 (좌측에서 볼 때)
    { -0.5f, -0.5f, -0.5f, 0.8f, 0.8f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌하 (좌측에서 볼 때)
    { -0.5f,  0.5f,  0.5f, 1.0f, 1.0f, 0.2f, 1.0f, 0.0f, 0.0f}, // 우상 (좌측에서 볼 때)
    { -0.5f,  0.5f,  0.5f, 1.0f, 1.0f, 0.2f, 1.0f, 0.0f, 0.0f}, // 우상 (좌측에서 볼 때)
    { -0.5f, -0.5f, -0.5f, 0.8f, 0.8f, 0.0f, 1.0f, 0.0f, 0.0f}, // 좌하 (좌측에서 볼 때)
    { -0.5f, -0.5f,  0.5f, 0.9f, 0.9f, 0.1f, 1.0f, 0.0f, 0.0f}, // 우하 (좌측에서 볼 때)

    // 윗면 (Top face) - Y = +0.5 - Magenta 계열 , (LH CW)
    { -0.5f,  0.5f, -0.5f, 1.0f, 0.0f, 1.0f, 1.0f, 0.0f}, // 좌상 (위에서 볼 때)
    { -0.5f,  0.5f,  0.5f, 0.8f, 0.0f, 0.8f, 1.0f, 0.0f}, // 좌하 (위에서 볼 때)
    {  0.5f,  0.5f, -0.5f, 1.0f, 0.2f, 1.0f, 1.0f, 0.0f}, // 우상 (위에서 볼 때)
    {  0.5f,  0.5f, -0.5f, 1.0f, 0.2f, 1.0f, 1.0f, 0.0f}, // 우상 (위에서 볼 때)
    { -0.5f,  0.5f,  0.5f, 0.8f, 0.0f, 0.8f, 1.0f, 0.0f}, // 좌하 (위에서 볼 때)
    {  0.5f,  0.5f,  0.5f, 0.9f, 0.1f, 0.9f, 1.0f, 0.0f}, // 우하 (위에서 볼 때)

    // 아랫면 (Bottom face) - Y = -0.5 - Cyan 계열, (LH CW)
    { -0.5f, -0.5f,  0.5f, 0.0f, 1.0f, 1.0f, 1.0f, 0.0f, 0.0f}, // 좌상 (아래에서 볼 때)
    { -0.5f, -0.5f, -0.5f, 0.0f, 0.8f, 0.8f, 1.0f, 0.0f, 0.0f}, // 좌하 (아래에서 볼 때)
    {  0.5f, -0.5f,  0.5f, 0.2f, 1.0f, 1.0f, 1.0f, 0.0f, 0.0f}, // 우상 (아래에서 볼 때)
    {  0.5f, -0.5f,  0.5f, 0.2f, 1.0f, 1.0f, 1.0f, 0.0f, 0.0f}, // 우상 (아래에서 볼 때)
    { -0.5f, -0.5f, -0.5f, 0.0f, 0.8f, 0.8f, 1.0f, 0.0f, 0.0f}, // 좌하 (아래에서 볼 때)
    {  0.5f, -0.5f, -0.5f, 0.1f, 0.9f, 0.9f, 1.0f, 0.0f, 0.0f}  // 우하 (아래에서 볼 때)
};